<template>
  <div class="font-ja">
    <p>
      色々ボードゲームやってきたけど、好みなのはワーカープレイスメントとか拡大再生産とかちょっと重めのやつかも。
    </p>
    <nuxt-link to="/boardgame/list" class="link block pt-2">
      持っているボードゲーム一覧
    </nuxt-link>
    <Cards :items="items" />
    <p>
      他にも、カタン、海底探検、タイムボム、スペースアラート、AZUL、カルカソンヌとかも好き。
    </p>
    <p>
      大体好きなんだけど、ブラフや人狼系だけは苦手。例外はタイムボム。あれは面白い。
    </p>
    <p>
      積んでるテラフォーミングマーズがやりたい今日このごろ。
    </p>
  </div>
</template>

<script>
import Cards from '~/components/molecules/Cards'

export default {
  components: {
    Cards
  },
  data() {
    return {
      items: [
        {
          img: '',
          title: 'エルフェンランド',
          content:
            'めっちゃ好き。どこをどの乗り物で通るか。他プレイヤーとの適度なインタラクションがあって、かといって邪魔されすぎないバランスがとても良い。全然思い通りに進めないけど、そこが良い。',
          tags: ['すごろく']
        },
        {
          img: '',
          title: 'ウイングスパン',
          content:
            '最近だとこれが好き。コンポーネントがかわいいし、ルールも簡単で初めてのひとでも入りやすい。アップグレードトークンも買っちゃったのだけど、めっちゃかわいい。',
          tags: ['エンジンビルド']
        },
        {
          img: '',
          title: '電力会社',
          content:
            'いやーこれめっちゃ面白い…。好き。リメイク版を買ったのだけど、説明書がわかりにくいのが難点。。。オークション形式で発電所を競り落とすときの心理戦というかなんというか、好き。',
          tags: ['オークション', '陣取り']
        },
        {
          img: '',
          title: '世界の七不思議',
          content:
            'ドラフトゲー。個人的に結構好きなんだけど、みんなあんまり遊びたがらない。。。すぐ終わるし、もう一回！！ってなるいいゲーム。ただ、場所は意外とめっちゃとる。',
          tags: ['ドラフト']
        },
        {
          img: '',
          title: 'Scythe',
          content:
            'めったに遊べないけど、好き。世界観もいいし、メックとかめっちゃかっこいい。別売りメタルコインもいい感じ。戦艦とか飛ばせちゃうのやばいよね。積んでるフェンリル襲来もはやく遊びたい。',
          tags: ['陣取り']
        },
        {
          img: '',
          title: 'ワイナリーの四季',
          content:
            '個人的に非常に遊びやすいワーカープレイスメント（だと思ってる）。こっちも別売りメタルコインを使うと雰囲気がでて良い。拡張のトスカーナでまだ遊んだことがないので遊びたい。',
          tags: ['ワーカープレイスメント']
        }
      ]
    }
  }
}
</script>
